app/Controllers/Kecamatan.php

SELECT *
FROM `kecamatan`
---
public function tampil(){
$kecamatan = new KecamatanModel();
// mengambil semua data di tabel kecamatan
$data['query'] = $kecamatan->findAll();